xpacks/stm32f7-cmsis/CMSIS/Driver/EMAC_STM32F7xx.c
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
/**
  \fn          void Enable_GPIO_Clock (const GPIO_TypeDef *port)
  \brief       Enable GPIO clock
*/
static void Enable_GPIO_Clock (const GPIO_TypeDef *GPIOx) {
  if      (GPIOx == GPIOA) { __HAL_RCC_GPIOA_CLK_ENABLE(); }
  else if (GPIOx == GPIOB) { __HAL_RCC_GPIOB_CLK_ENABLE(); }
  else if (GPIOx == GPIOC) { __HAL_RCC_GPIOC_CLK_ENABLE(); }
  else if (GPIOx == GPIOD) { __HAL_RCC_GPIOD_CLK_ENABLE(); }
  else if (GPIOx == GPIOE) { __HAL_RCC_GPIOE_CLK_ENABLE(); }
#if defined(GPIOF)
  else if (GPIOx == GPIOF) { __HAL_RCC_GPIOF_CLK_ENABLE(); }
#endif
#if defined(GPIOG)
  else if (GPIOx == GPIOG) { __HAL_RCC_GPIOG_CLK_ENABLE(); }
#endif
#if defined(GPIOH)
  else if (GPIOx == GPIOH) { __HAL_RCC_GPIOH_CLK_ENABLE(); }
#endif
#if defined(GPIOI)
  else if (GPIOx == GPIOI) { __HAL_RCC_GPIOI_CLK_ENABLE(); }
#endif
#if defined(GPIOJ)
  else if (GPIOx == GPIOJ) { __HAL_RCC_GPIOJ_CLK_ENABLE(); }
#endif
#if defined(GPIOK)
  else if (GPIOx == GPIOK) { __HAL_RCC_GPIOK_CLK_ENABLE(); }
#endif
}
#endif

/**
  \fn          void init_rx_desc (void)
  \brief       Initialize Rx DMA descriptors.
  \return      none.
*/
static void init_rx_desc (void) {
  uint32_t i,next;

  for (i = 0U; i < NUM_RX_BUF; i++) {
    Desc.rx[i].Stat = DMA_RX_OWN;
    Desc.rx[i].Ctrl = DMA_RX_RCH | ETH_BUF_SIZE;
    Desc.rx[i].Addr = (uint8_t *)&Desc.rx_buf[i];
    next = i + 1U;
    if (next == NUM_RX_BUF) { next = 0U; }
    Desc.rx[i].Next = &Desc.rx[next];
  }

  ETH->DMARDLAR = (uint32_t)&Desc.rx[0];
  Emac.rx_index = 0U;
}

/**
  \fn          void init_tx_desc (void)
  \brief       Initialize Tx DMA descriptors.
  \return      none.
*/
static void init_tx_desc (void) {
  uint32_t i,next;

  for (i = 0; i < NUM_TX_BUF; i++) {
    Desc.tx[i].CtrlStat = DMA_TX_TCH | DMA_TX_LS | DMA_TX_FS;
    Desc.tx[i].Addr     = (uint8_t *)&Desc.tx_buf[i];
    next = i + 1U;
    if (next == NUM_TX_BUF) { next = 0U; }
    Desc.tx[i].Next     = &Desc.tx[next];
  }
  ETH->DMATDLAR = (uint32_t)&Desc.tx[0];
  Emac.tx_index = 0U;
}

/**
  \fn          uint32_t crc32_8bit_rev (uint32_t crc32, uint8_t val)
  \brief       Calculate 32-bit CRC (Polynomial: 0x04C11DB7, data bit-reversed).
  \param[in]   crc32  CRC initial value
  \param[in]   val    Input value
  \return      Calculated CRC value
*/
static uint32_t crc32_8bit_rev (uint32_t crc32, uint8_t val) {
  uint32_t n;

  crc32 ^= __RBIT (val);
  for (n = 8; n; n--) {
    if (crc32 & 0x80000000U) {
      crc32 <<= 1;
      crc32  ^= 0x04C11DB7U;
    } else {
      crc32 <<= 1;
    }
  }
  return (crc32);
}

/**
  \fn          uint32_t crc32_data (const uint8_t *data, uint32_t len)
  \brief       Calculate standard 32-bit Ethernet CRC.
  \param[in]   data  Pointer to buffer containing the data
  \param[in]   len   Data length in bytes
  \return      Calculated CRC value
*/
static uint32_t crc32_data (const uint8_t *data, uint32_t len) {
  uint32_t cnt, crc;

  crc = 0xFFFFFFFFU;
  for (cnt = len; cnt; cnt--) {
    crc = crc32_8bit_rev (crc, *data++);
  }
  return (crc ^ 0xFFFFFFFFU);
}

#if (RTE_ETH_SMI_SW == 1) /* Software MDIO */
/**
  \fn          void SW_MDIO_Dir (uint32_t dir)
  \brief       Turnaround MDO
  \param[in]   dir  MDIO direction: 0=input, 1=output
*/
static void SW_MDIO_Init (void) {
  GPIO_InitTypeDef GPIO_InitStruct;

  /* Set MDC as output */
  GPIO_InitStruct.Pin   = MX_ETH_MDC_GPIO_Pin;
  GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(MX_ETH_MDC_GPIOx, &GPIO_InitStruct);

  HAL_GPIO_WritePin (MX_ETH_MDC_GPIOx, MX_ETH_MDC_GPIO_Pin, GPIO_PIN_RESET);
}

/**
  \fn          void SW_MDIO_Dir (uint32_t dir)
  \brief       Turnaround MDO
  \param[in]   dir  MDIO direction: 0=input, 1=output
*/
static void SW_MDIO_Dir (uint32_t dir) {
  GPIO_InitTypeDef GPIO_InitStruct;

  /* Set MDIO as input */
  GPIO_InitStruct.Pin   = MX_ETH_MDIO_GPIO_Pin;
  GPIO_InitStruct.Mode  = (dir) ? (GPIO_MODE_OUTPUT_PP) : (GPIO_MODE_INPUT);
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(MX_ETH_MDIO_GPIOx, &GPIO_InitStruct);
  
  if (dir == 0) {
    HAL_GPIO_WritePin (MX_ETH_MDC_GPIOx, MX_ETH_MDC_GPIO_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin (MX_ETH_MDC_GPIOx, MX_ETH_MDC_GPIO_Pin, GPIO_PIN_RESET);
  }
}

/**
  \fn          void SW_MDIO_Write (uint32_t data, uint32_t len)
  \brief       Output a data to the MII PHY management interface.
  \param[in]   data  Data to write
  \param[in]   len   Data length in bits
*/
static void SW_MDIO_Write (uint32_t data, uint32_t len) {

  data <<= (32 - len);
  for (; len; len--) {
    /* Set data bit */
    HAL_GPIO_WritePin (MX_ETH_MDIO_GPIOx, MX_ETH_MDIO_GPIO_Pin, (data & 0x80000000) ? GPIO_PIN_SET : GPIO_PIN_RESET);
    /* Clock it out */
    HAL_GPIO_WritePin (MX_ETH_MDC_GPIOx, MX_ETH_MDC_GPIO_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin (MX_ETH_MDC_GPIOx, MX_ETH_MDC_GPIO_Pin, GPIO_PIN_RESET);

    data <<= 1;
  }
}

/**
  \fn          uint32_t SW_MDIO_Read (void)
  \brief       Read a value from the MII PHY management interface.
  \return      Data read
*/
static uint32_t SW_MDIO_Read (void) {
  uint32_t i;
  uint32_t data = 0;

  for (i = 0; i < 16; i++) {
    data <<= 1;
    /* Clock in data bit */
    HAL_GPIO_WritePin (MX_ETH_MDC_GPIOx, MX_ETH_MDC_GPIO_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin (MX_ETH_MDC_GPIOx, MX_ETH_MDC_GPIO_Pin, GPIO_PIN_RESET);
    if (HAL_GPIO_ReadPin(MX_ETH_MDIO_GPIOx, MX_ETH_MDIO_GPIO_Pin) == GPIO_PIN_SET) {
      data |= 1;
    }
  }
  return (data);
}
#endif


/* Ethernet Driver functions */

/**
  \fn          ARM_DRIVER_VERSION ARM_ETH_MAC_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION GetVersion (void) {
  return DriverVersion;
}


/**
  \fn          ARM_ETH_MAC_CAPABILITIES GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_ETH_MAC_CAPABILITIES
*/
static ARM_ETH_MAC_CAPABILITIES GetCapabilities (void) {
  return DriverCapabilities;
}


/**
  \fn          int32_t Initialize (ARM_ETH_MAC_SignalEvent_t cb_event)
  \brief       Initialize Ethernet MAC Device.
  \param[in]   cb_event  Pointer to \ref ARM_ETH_MAC_SignalEvent
  \return      \ref execution_status
*/
static int32_t Initialize (ARM_ETH_MAC_SignalEvent_t cb_event) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
  GPIO_InitTypeDef GPIO_InitStruct;
  const ETH_PIN *io;
#endif

  /* Enable SYSCFG clock */
  RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

  #if (ETH_MII == 0)
  SYSCFG->PMC |=  SYSCFG_PMC_MII_RMII_SEL;
  #else
  SYSCFG->PMC &= ~SYSCFG_PMC_MII_RMII_SEL;
  #endif

