xpacks/stm32f7-cmsis/CMSIS/Driver/EMAC_STM32F7xx.c
#else /* Software MDIO */
  SW_MDIO_Dir (1); /* Dir: output */

  /* 32 consecutive ones on MDO to establish sync */
  SW_MDIO_Write (0xFFFFFFFF, 32);

  /* Start code (01), Write command (01) */
  SW_MDIO_Write (0x05, 4);

  /* Write PHY device address */
  SW_MDIO_Write (phy_addr, 5);

  /* Write PHY register address */
  SW_MDIO_Write (reg_addr, 5);

  /* Turnaround MDIO (1,0)*/
  SW_MDIO_Write (0x02, 2);

  /* Write the data value */
  SW_MDIO_Write (data, 16);

  /* Turnaround MDO is tristated */
  SW_MDIO_Dir (0); /* Dir: input */

  return ARM_DRIVER_OK;
#endif
}


/* Ethernet IRQ Handler */
void ETH_IRQHandler (void) {
  uint32_t dmasr, macsr, event = 0;

  dmasr = ETH->DMASR;
  ETH->DMASR = dmasr & (ETH_DMASR_NIS | ETH_DMASR_RS | ETH_DMASR_TS);
  if (dmasr & ETH_DMASR_TS)   { event |= ARM_ETH_MAC_EVENT_TX_FRAME; }
  if (dmasr & ETH_DMASR_RS)   { event |= ARM_ETH_MAC_EVENT_RX_FRAME; }
  macsr = ETH->MACSR;
#if (EMAC_TIME_STAMP != 0)
  if (macsr & ETH_MACSR_TSTS) { event |= ARM_ETH_MAC_EVENT_TIMER_ALARM; }
#endif
  if (macsr & ETH_MACSR_PMTS) {
    ETH->MACPMTCSR;
    event |= ARM_ETH_MAC_EVENT_WAKEUP;
  }

  /* Callback event notification */
  if (event && Emac.cb_event) {
    Emac.cb_event (event);
  }
}


/* MAC Driver Control Block */
ARM_DRIVER_ETH_MAC Driver_ETH_MAC0 = {
  GetVersion,
  GetCapabilities,
  Initialize,
  Uninitialize,
  PowerControl,
  GetMacAddress,
  SetMacAddress,
  SetAddressFilter,
  SendFrame,
  ReadFrame,
  GetRxFrameSize,
  GetRxFrameTime,
  GetTxFrameTime,
  ControlTimer,
  Control,
  PHY_Read,
  PHY_Write
};
